{"weightsManifest": [{"paths": ["group1-shard1of8", "group1-shard2of8", "group1-shard3of8", "group1-shard4of8", "group1-shard5of8", "group1-shard6of8", "group1-shard7of8", "group1-shard8of8"], "weights": [{"name": "dense_1/kernel", "shape": [1024, 3182], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3182], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [3182, 256], "dtype": "float32"}, {"name": "gru_1/kernel", "shape": [256, 3072], "dtype": "float32"}, {"name": "gru_1/recurrent_kernel", "shape": [1024, 3072], "dtype": "float32"}, {"name": "gru_1/bias", "shape": [3072], "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": -0.05, "maxval": 0.05, "seed": null}}, "input_length": null, "batch_input_shape": [1, null], "output_dim": 256, "name": "embedding_1", "dtype": "float32", "activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "input_dim": 3182, "mask_zero": false, "embeddings_constraint": null}}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "tanh", "kernel_regularizer": null, "activity_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_dropout": 0.0, "use_bias": true, "unroll": false, "go_backwards": false, "reset_after": false, "bias_constraint": null, "units": 1024, "kernel_constraint": null, "recurrent_constraint": null, "name": "gru_1", "trainable": true, "dtype": "float32", "stateful": true, "bias_regularizer": null, "implementation": 1, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dropout": 0.0, "recurrent_activation": "sigmoid"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "units": 3182, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}}, "keras_version": "2.1.6-tf"}}