{"modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"output_dim": 256, "activity_regularizer": null, "mask_zero": false, "name": "embedding_1", "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "maxval": 0.05, "minval": -0.05, "seed": null}}, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "trainable": true, "batch_input_shape": [1, null], "input_dim": 7632}}, {"class_name": "GRU", "config": {"dropout": 0.0, "bias_regularizer": null, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "return_sequences": true, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "units": 1024, "name": "gru_1", "trainable": true, "recurrent_dropout": 0.0, "implementation": 1, "activation": "tanh", "unroll": false, "stateful": true, "recurrent_activation": "sigmoid", "return_state": false, "reset_after": false, "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "units": 7632, "name": "dense_1", "trainable": true}}], "name": "sequential_1"}}}, "weightsManifest": [{"paths": ["group1-shard1of14", "group1-shard2of14", "group1-shard3of14", "group1-shard4of14", "group1-shard5of14", "group1-shard6of14", "group1-shard7of14", "group1-shard8of14", "group1-shard9of14", "group1-shard10of14", "group1-shard11of14", "group1-shard12of14", "group1-shard13of14", "group1-shard14of14"], "weights": [{"dtype": "float32", "shape": [1024, 7632], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [7632], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [7632, 256], "name": "embedding_1/embeddings"}, {"dtype": "float32", "shape": [256, 3072], "name": "gru_1/kernel"}, {"dtype": "float32", "shape": [1024, 3072], "name": "gru_1/recurrent_kernel"}, {"dtype": "float32", "shape": [3072], "name": "gru_1/bias"}]}]}